IlleniumDillon/MM32F5277/PinMap/MM32_I2C_PinMap.c
#include "MM32_I2C_PinMap.h"

MM32_I2C_Pin I2C1_SCL_PA8   = {.periBase = I2C1, .port = GPIOA, .pin = P08, .af = AF04};
MM32_I2C_Pin I2C1_SCL_PA9   = {.periBase = I2C1, .port = GPIOA, .pin = P09, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PA10  = {.periBase = I2C1, .port = GPIOA, .pin = P10, .af = AF04};
MM32_I2C_Pin I2C1_SMBA_PA11 = {.periBase = I2C1, .port = GPIOA, .pin = P11, .af = AF04};
MM32_I2C_Pin I2C1_SMBA_PA13 = {.periBase = I2C1, .port = GPIOA, .pin = P13, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PA14  = {.periBase = I2C1, .port = GPIOA, .pin = P14, .af = AF04};
MM32_I2C_Pin I2C1_SCL_PA15  = {.periBase = I2C1, .port = GPIOA, .pin = P15, .af = AF04};

MM32_I2C_Pin I2C1_SMBA_PB5  = {.periBase = I2C1, .port = GPIOB, .pin = P05, .af = AF04};
MM32_I2C_Pin I2C1_SCL_PB6   = {.periBase = I2C1, .port = GPIOB, .pin = P06, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PB7   = {.periBase = I2C1, .port = GPIOB, .pin = P07, .af = AF04};
MM32_I2C_Pin I2C1_SCL_PB8   = {.periBase = I2C1, .port = GPIOB, .pin = P08, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PB9   = {.periBase = I2C1, .port = GPIOB, .pin = P09, .af = AF04};

MM32_I2C_Pin I2C1_SCL_PC0   = {.periBase = I2C1, .port = GPIOC, .pin = P00, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PC1   = {.periBase = I2C1, .port = GPIOC, .pin = P01, .af = AF04};
MM32_I2C_Pin I2C1_SCL_PC6   = {.periBase = I2C1, .port = GPIOC, .pin = P06, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PC7   = {.periBase = I2C1, .port = GPIOC, .pin = P07, .af = AF04};

MM32_I2C_Pin I2C1_SCL_PD10  = {.periBase = I2C1, .port = GPIOD, .pin = P10, .af = AF04};
MM32_I2C_Pin I2C1_SDA_PD11  = {.periBase = I2C1, .port = GPIOD, .pin = P11, .af = AF04};
MM32_I2C_Pin I2C1_SMBA_PD12 = {.periBase = I2C1, .port = GPIOD, .pin = P12, .af = AF04};

MM32_I2C_Pin I2C1_SMBA_PI1  = {.periBase = I2C1, .port = GPIOI, .pin = P01, .af = AF04};

MM32_I2C_Pin I2C2_SCL_PB10  = {.periBase = I2C2, .port = GPIOB, .pin = P10, .af = AF04};
MM32_I2C_Pin I2C2_SDA_PB11  = {.periBase = I2C2, .port = GPIOB, .pin = P11, .af = AF04};
MM32_I2C_Pin I2C2_SMBA_PB12 = {.periBase = I2C2, .port = GPIOB, .pin = P12, .af = AF04};

MM32_I2C_Pin I2C2_SCL_PC2   = {.periBase = I2C2, .port = GPIOC, .pin = P02, .af = AF04};
MM32_I2C_Pin I2C2_SDA_PC3   = {.periBase = I2C2, .port = GPIOC, .pin = P03, .af = AF04};
MM32_I2C_Pin I2C2_SCL_PC8   = {.periBase = I2C2, .port = GPIOC, .pin = P08, .af = AF04};
MM32_I2C_Pin I2C2_SDA_PC9   = {.periBase = I2C2, .port = GPIOC, .pin = P09, .af = AF04};

MM32_I2C_Pin I2C2_SMBA_PE4  = {.periBase = I2C2, .port = GPIOE, .pin = P04, .af = AF04};
MM32_I2C_Pin I2C2_SCL_PE5   = {.periBase = I2C2, .port = GPIOE, .pin = P05, .af = AF04};
MM32_I2C_Pin I2C2_SDA_PE6   = {.periBase = I2C2, .port = GPIOE, .pin = P06, .af = AF04};

MM32_I2C_Pin I2C2_SDA_PF0   = {.periBase = I2C2, .port = GPIOF, .pin = P00, .af = AF04};
MM32_I2C_Pin I2C2_SCL_PF1   = {.periBase = I2C2, .port = GPIOF, .pin = P01, .af = AF04};
MM32_I2C_Pin I2C2_SMBA_PF2  = {.periBase = I2C2, .port = GPIOF, .pin = P02, .af = AF04};